[
    {
        "_id":1,
        "_picture":"Rachel",
        "_name":"Rachel Green",
        "_actor":"Jennifer Aniston",
        "_bio":"Rachel Karen Green is the spoiled but warm-hearted and likable daughter of a rich vascular surgeon and his wife. Rachel is introduced into the series in the first episode after she leaves her fiancé, Barry, at the altar, and attempts to live independently without financial support from her parents.[e 1] She flees from her almost-wedding to New York City to find Monica Geller, her friend from high school. Rachel moves into Monica's apartment and meets Phoebe Buffay and Joey Tribbiani. Rachel already knows Ross Geller, Monica's brother, as all three went to the same high school. In the first episode, she is also introduced to Chandler Bing, Ross's college buddy; however, later episodes retcon this, and she is shown to have met Chandler on previous occasions whilst Ross was at college. Rachel's first job is as a waitress at Central Perk coffee house. She later begins to work in fashion, becoming an assistant buyer, and later a personal shopper, at Bloomingdale's. She eventually becomes a buyer at Polo Ralph Lauren. A great deal of Rachel's life throughout the series revolves around her relationship with Ross Geller. At the end of season seven, during Monica's and Chandler's wedding, it is revealed that Rachel is pregnant from a one-night stand with Ross. Initially, Rachel is determined to raise the baby on her own, but later she realizes she needs Ross's help. She decides to move in with Ross, even though the two are not involved in a relationship. Their daughter, Emma, is born during the eighth-season finale. Emma's aunt, Monica, is the one who chooses her name. She states in the beginning of season nine that (Emma) is what she wanted to name her daughter. Rachel really liked the name, so Monica gives it to her indicating her love of their friendship. During the tenth season, Rachel is offered a job with Louis Vuitton in Paris. She accepts and prepares to move herself and Emma to France. However, in the series finale, she declines the job offer and famously 'gets off the plane'. Rachel and Ross get back together in the final episode of the series.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":2,
        "_picture":"Monica",
        "_name":"Monica Geller",
        "_actor":"Courtney Cox",
        "_bio":"Monica E. Geller is the younger sister of Ross and best friend of Rachel, the latter of whom she allows to live with her after Rachel forsakes her own wedding. She works primarily as a chef at a variety of restaurants. She is described as the mother hen of the group,[18] and is known for her obsessive-compulsive and competitive nature.[19][20] Monica is often jokingly teased by the others, especially Ross, for having been extremely overweight as a child. In the second season, Monica falls for her father Jack's (Elliott Gould) friend, Richard Burke (Tom Selleck). Despite the twenty-one year age difference, Monica and Richard are happy, and her parents accept their relationship. However, as a result of Monica yearning for a family but Richard having already had one, they break up at the end of the second season. Monica then pursues a chain of various men until she unexpectedly begins a relationship with her longtime friend, Chandler Bing, at the end of the fourth season, during her brother Ross' wedding to Emily Waltham. Monica and Chandler try to hide their relationship from the rest of the group for much of the fifth season, but eventually everyone finds out. After celebrating their first anniversary in Las Vegas, they move in together and get engaged by the sixth-season finale. After their marriage, Monica and Chandler try to conceive children, only to discover that they are unable to do so. In the final season of the series, they adopt new-born twins, whom they name Erica and Jack.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":3,
        "_picture":"Phoebe",
        "_name":"Phoebe Buffay",
        "_actor":"Lisa Kudrow",
        "_bio":"Phoebe Buffay-Hannigan is an odd, ditzy albeit sweet-natured masseuse who grew up homeless, sometimes telling her friends outlandish tales of life on the street. She is an aspiring musician who plays the guitar and sings songs with somewhat unusual lyrics at the coffee shop. She has an identical twin sister, Ursula (also played by Kudrow), who is just as odd as Phoebe and appeared as a recurring character on Mad About You. After a series of dates and relationships with a number of men, Phoebe meets Mike Hannigan (Paul Rudd) in season nine, whom she eventually marries in season ten. She also became a surrogate mother for her half-brother Frank Jr., giving birth to his triplets in the fifth season.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":4,
        "_picture":"Joey",
        "_name":"Joey Tribbiani",
        "_actor":"Matt Leblanc",
        "_bio":"Joseph Francis 'Joey' Tribbiani Jr. is a good-natured but not-so-bright struggling actor and food lover, who becomes mildly famous for his role as Dr. Drake Ramoray on a fictionalized version of Days of Our Lives. Joey is a womanizer, with many girlfriends throughout the series, often using his catchphrase pick-up line 'How you doin?' He develops a crush on Rachel in season eight.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":5,
        "_picture":"Chandler",
        "_name":"Chandler Bing",
        "_actor":"Matthew Perry",
        "_bio":"Chandler Muriel Bing is an executive in statistical analysis and data reconfiguration for a large multi-national corporation. He later quits his job and becomes a junior copywriter at an advertising agency. Chandler is known for his sarcastic sense of humor. He often mocks his best friend Joey for the latter's stupidity. Chandler is often depicted as being somewhat of a hapless individual, suffering a lot of bad luck while struggling through life and occasionally struggling with an on-and-off smoking addiction. However, he eventually falls in deep mutual love with Monica and proposes to her at the close of season six, with the two of them marrying at the close of season seven. By the end of series, he and Monica adopt twins, whom they name Jack and Erica.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":6,
        "_picture":"Ross",
        "_name":"Ross Geller",
        "_actor":"David Schwimmer",
        "_bio":"Dr. Ross Eustace Geller, Ph.D. (David Schwimmer) is a paleontologist at a museum of prehistory, and later a professor of paleontology at New York University. The most intelligent of the six main characters, but at the same time a clumsy, quirky man, Ross is known for being a smart, know-it-all who prides himself on his rationality, despite his clear hopeless romanticism. He is shown to be the most caring of all the six members in the various instances on the show. Ross is Monica's older brother, Chandler's college roommate, and Rachel's on-again, off-again boyfriend. His first marriage has already failed by the time the show begins, with his second lasting mere weeks. The second divorce seemed to greatly depress him and make him quick-tempered near the start of season five, such as when he screams at his colleague for taking his sandwich and throwing it away. After he gets Ugly Naked Guy's apartment, he is offered to return to work, but he loses his temper again when he sees Chandler and Monica having sex through his window, becoming the last one to find out about their relationship. He also drunkenly married Rachel in Las Vegas, after which they unsuccessfully tried to annul it and had to settle for a divorce, which became Ross' third one. Ross's relationship with Rachel is a major storyline throughout the series. He is also the father of his ex-wife Carol's son, Ben, and Rachel's daughter, Emma. In the series finale, Ross and Rachel finally reconcile, deciding to be together once and for all.",
        "_isMain":true,
        "_season":0
    },
    {
        "_id":7,
        "_picture":"Gunther",
        "_name":"Gunther",
        "_actor":"James Michael Tyler",
        "_bio":"Gunther (James Michael Tyler): The manager of the Central Perk coffee house, who first appears as a background character in 'The One with the Sonogram at the End'. He is a former actor who once played Bryce on All My Children before that character was 'killed in an avalanche.'' Gunther develops an unrequited crush on Rachel in the third season, which he keeps to himself until 'The Last One'. Apart from Ross, whom he dislikes, he is on reasonably good terms with the rest of the gang despite occasionally being annoyed by wacky antics or comments from them. His motivation for disliking Ross is jealousy (as he is aware of Ross's relationship with Rachel), which is made clear numerous times, most notably in 'The One with the Morning After' when he reveals to Rachel that Ross (who mistakenly thought at the time that his relationship with her was over—'We were on a break') cheated on her. Gunther appears in a majority of the episodes, but only occasionally calls attention to himself and almost never has a large role in the plot of an episode. In 'The One With The Stain', Gunther is shown to be fluent in Dutch (although with a strong American accent), calling Ross an 'ezel' as he converses with him.",
        "_isMain":false,
        "_season":1
    },
    {
        "_id":8,
        "_picture":"Jack",
        "_name":"Jack Geller",
        "_actor":"Elliott Gould",
        "_bio":"Ross and Monica's father. In early appearances, Jack frequently makes inappropriate comments, which he punctuates by exclaiming 'I'm just saying...!' Judy often makes condescending remarks about Monica's lack of a love life and sometimes forgets her daughter even exists, while simultaneously favoring Ross. Jack is more balanced in his attention and care towards both Ross and Monica. After the Gellers sell their house in season 7, it is revealed that Jack has used boxes of Monica's old stuff to block rainwater from getting to his Porsche. Due to his gnawing guilt, Jack develops a secret smoking habit and decides to gift Monica the Porsche. Despite being favored throughout his entire childhood, this makes Ross insanely jealous. Despite each of them having their own quirks, however, they are both occasionally dumbfounded by the crazy antics of their son and daughter, such as Ross' disastrous wedding to Emily and Monica's ridiculous speech at their 35th anniversary party. They are also sometimes bemused by the antics of the other four friends, such as idiotic or crazy comments from Phoebe and/or Joey, a revolting trifle cooked by Rachel which Joey is happy to eat and Chandler entering a coed whirlpool alongside Jack without wearing anything underneath the towel wrapped around his waist.",
        "_isMain":false,
        "_season":1
    },
    {
        "_id":9,
        "_picture":"Barry",
        "_name":"Barry Farber",
        "_actor":"Mitchell Whitfield",
        "_bio":"Rachel's jilted fiancé. Barry, an orthodontist, decides to go on his and Rachel's honeymoon with her maid of honor Mindy, and soon begins a relationship with her. Their relationship hits a rough patch when he and Rachel consider getting back together. He decides to stay with Mindy, and the two are later married. Rachel is invited to the wedding, but receives a cold reception for jilting Barry while she is there, and a ridiculous speech from Ross which bemuses everyone in the room does not exactly improve the situation for her, until she, in a desperate attempt to salvage some pride, walks onto the stage where the microphone is and starts singing the Copacabana. Barry and Mindy are said to have divorced five years later, after she found out he was cheating on her. Barry's last name is given as 'Finkle' in the pilot and 'Farber' in every other appearance except in 'The One with the Flashback',where he is referred to as 'Barry Barber'. He has also been called 'Barry White', and is possibly[original research?] named as an homage to long-time NY talk show host Barry Farber.",
        "_isMain":false,
        "_season":1
    },
    {
        "_id":10,
        "_picture":"Carol",
        "_name":"Carol Willick",
        "_actor":"Jane Sibbett",
        "_bio":"Carol is Ross' lesbian ex-wife, who came out before the pilot, and Susan is her partner. Carol divorced Ross to be with Susan. In the second episode of the series, Carol tells Ross that she is pregnant with his child,[e 11] and is having the baby with her partner Susan, though she wishes Ross to be part of the baby's life. Carol and Susan are often bemused by Ross' behavior throughout his onscreen appearances with them. Though Ross and Carol are on good terms after their divorce, Ross resents Susan on some level for losing Carol to her. Although Susan and Ross are initially, naturally enough, often at odds, they briefly put aside their differences when Carol gives birth to a boy, whom they all agree, after weeks of argument, to name Ben. Carol and Susan announce their plans to get married in 'The One with the Lesbian Wedding', but Carol's parents refuse to attend the wedding, leading Carol to doubt her decision. Ross initially hesitant to see his ex-wife remarry, finds himself in the position of being the one to encourage her to go ahead with the ceremony despite her parents' opposition. At the reception, Susan thanks Ross for his part in saving the wedding, and offers to dance with him; he agrees, apparently resolving their strained relationship. Carol and Susan make irregular appearances until 'The One That Could Have Been' (Susan), and 'The One with the Truth About London' (Carol).",
        "_isMain":false,
        "_season":1
    },
    {
        "_id":11,
        "_picture":"Paolo",
        "_name":"Paolo",
        "_actor":"Cosimo Fusco",
        "_bio":"an Italian neighbor in Rachel's building, who Rachel meets and hooks up with in 'The One with the Blackout'. They start dating, making Ross jealous. She dumps him after he gropes Phoebe[e 33] but has a last one-night stand with him in 'The One with Ross's New Girlfriend'. In the Italian version of the show, Paolo's name is changed to Pablo and his nationality is Spanish",
        "_isMain":false,
        "_season":1
    },
    {
        "_id":12,
        "_picture":"Richard",
        "_name":"Richard Burke",
        "_actor":"Tom Selleck",
        "_bio":"an ophthalmologist and best friend of Jack Geller. Richard is introduced in 'The One Where Ross and Rachel … You Know' when Monica caters an event at his apartment. He begins to date her despite being 21 years older, infuriating Monica's parents when they find out. He and Monica break up in 'The One with Barry and Mindy's Wedding' when he tells her he does not want more children, his own having already reached adulthood. Despite the two still being in love, they cannot reconcile this difference, and are both devastated for months. He makes a brief voice cameo in 'The One Where No One's Ready',and later they briefly attempt to rekindle their romance as 'friends' before accepting that the reasons they broke up remain valid. In 'The One in Vegas', Monica and Richard bump into each other off-screen and have lunch together. Monica does not feel anything for Richard but refrains from telling Chandler because of their upcoming anniversary. When he learns the truth, they fight for most of the episode until Monica assures Chandler that she will never see Richard again. In 'The One with the Proposal', he runs into Monica and Chandler at dinner. While Chandler is planning to propose but pretends to be against marriage because he 'wants it to be a surprise', Richard stuns Monica by telling her that he still loves her, and wants to marry her and have kids with her. Monica rejects him but later arrives at his apartment, frustrated with her own situation. She complains to him for a bit about how bad things are going in her love life before leaving to think things over. Eventually, Chandler comes to his apartment searching for Monica and tells Richard of his own proposal plan. Richard seems to lack sympathy for Chandler at first, responding to Chandler explaining away his plan to make her initially think he was against marriage by stating it had 'worked very well' but when Chandler angrily tells him he has no right to ruin another man's relationship with her because he's already ruined his own, he realizes Chandler is right and tells him, 'You go get her, Chandler. And can I give you a bit of advice? If you get her, don't let her go. Trust me' — noting that he hates the fact that he is a nice guy when Chandler thanks him. His apartment is put up for sale in season 9, in 'The One with Ross's Inappropriate Song',but Richard is not seen. While there, Chandler finds out that Richard made a sex tape with Monica which he steals and watches, but he and Monica later discover that Richard taped over her, relieving Chandler but leaving Monica feeling insulted.",
        "_isMain":false,
        "_season":2
    },
    {
        "_id":13,
        "_picture":"Franck",
        "_name":"Franck Buffay Jr.",
        "_actor":"Giovanni Ribisi",
        "_bio":"Phoebe's half-brother by their father. In 'The One with the Bullies', Phoebe meets him after finding the courage to knock on her father's suburban door, but learns from Frank Jr.'s mother (played by Laraine Newman) that her father walked out several years ago. Despite not finding her father, she connects with Frank Jr. who later visits the city[e 74] where he hits on Jasmine, one of Phoebe's coworkers, and mistakes her massage parlor for a whorehouse. He eventually falls in love with and becomes engaged to Alice Knight (Debra Jo Rupp), his former home-economics teacher who is 26 years his senior. In 'The One With Phoebe's Uterus', Frank and Alice ask Phoebe to be a surrogate mother for their child, and she later gives birth to their triplets, whom she then says goodbye to in an emotional scene in 'The One Hundredth'. Frank makes a final appearance in 'The One Where Ross is Fine', when he and the triplets meet Phoebe at Central Perk. In the episode, he claims he 'hasn't slept in four years' and is so exhausted with raising the triplets he even proposed that Phoebe take one for her own. However, he soon realizes he loves his children too much to give any of them up; Phoebe proposes to start babysitting them so that Frank and Alice can enjoy some more time off.",
        "_isMain":false,
        "_season":2
    },
    {
        "_id":14,
        "_picture":"Mark",
        "_name":"Mark Robinson",
        "_actor":"Steven Eckholdt",
        "_bio":"Rachel’s colleague in Bloomingdale’s. He first appears in 'The One Where Chandler Can't Remember Which Sister'. Ross is jealous of Mark as he mistakenly suspects that he and Rachel are having an affair. His fears are amplified when although Mark quits for a different job in 'The One With Phoebe's Ex-Partner', he and Rachel make plans to attend a fashion seminar together, prompting a jealous Ross to volunteer to go in his place with her. It is Mark's presence at Rachel's apartment after he offered to provide her with comfort after her fight with Ross which leads Ross, overhearing his voice in the background after phoning Rachel and mistakenly thinking he is there to have sex with her, to become convinced that his relationship with her is now over and, after angrily hanging up, get drunk and sleep with Chloe ultimately ending Ross and Rachel's relationship. Later, Mark asks Rachel on a date and she accepts, however she rejects his advances when she realizes she only accepted the offer to get back at Ross. That is the last time Mark is seen until 'The One with Princess Consuela', where he encounters Rachel and Ross after she has been fired from Ralph Lauren, and takes her out to dinner where he offers her a new job with Louis Vuitton in Paris. Ross fails to recognize him but becomes jealous all over again once reminded, even declaring his extreme hatred of Mark and forbids Rachel of going to dinner with him and with both of Ross and Rachel's breakups in Seasons 3 and 4, both of which Mark was responsible for, oddly being unmentioned. It is also revealed that since his previous appearance he has married and had kids (twins, actually) – once informed of this, an embarrassed Ross wonders: 'Should we send something?' Though Ross attempts to counter Mark's job offer by getting Rachel her job back at Ralph Lauren, he eventually relents upon realizing Rachel wants to go to Paris. However, when Ross confesses to Rachel at the airport that he is still in love with her, Rachel gets off the plane at the last minute to reunite with him, turning down Mark's job offer.",
        "_isMain":false,
        "_season":3
    },
    {
        "_id":15,
        "_picture":"Doug",
        "_name":"Doug",
        "_actor":"Sam McMurray",
        "_bio":"Chandler's new boss in 'The One with the Ultimate Fighting Champion'. Doug enjoys calling Chandler 'Bing!' and slapping his male colleagues on the butt. Monica and Chandler play a game of tennis with Doug and his wife, who are left exhausted, irritated and bewildered by Monica's ridiculously overly-competitive attitude in 'The One with Chandler's Work Laugh' (January 21, 1999; Season 5, No. 12). In this episode, it is implied that he, his wife, and the rest of Chandler's co-workers all dislike Joey, whom Chandler claims damaged his reputation in their eyes (presumably with all his stupidity) after he invited him to a work office party, damage repaired by Monica when he invited her to a different one. In 'The One with Ross's Step Forward' (airdate December 13; 2001; Season 8, No. 11), he invites Monica and Chandler to dinner to celebrate his divorce. To get out of it, Chandler pretends that he wants to be on his own because he and Monica have split up but it backfires when Doug, who despite his seemingly cheerful and relieved attitude towards his divorce is in reality clearly depressed over it, tries to cheer Chandler up by taking him to strip clubs, drunkenly throwing cans at birds and throwing (Doug's) wedding ring into the gutter (Chandler had refused Doug's offer at first, but then made the mistake of thoughtlessly stating his reason for this as being that Monica would not appreciate it, only to then be forced to correct himself upon seeing Doug's confused expression). It is also revealed in this episode that he urinated on an ice sculpture during Monica and Chandler’s engagement party, and this is why he was not invited to the wedding.",
        "_isMain":false,
        "_season":3
    },
    {
        "_id":16,
        "_picture":"Bonnie",
        "_name":"Bonnie",
        "_actor":"Christine Taylor",
        "_bio":"Phoebe's formerly bald friend, first mentioned in episode 'The One with the Candy Hearts' (although referred to as 'Abby' then), whom she sets up with Ross in 'The One with the Ultimate Fighting Champion'. Rachel met Bonnie two years prior to the events of this episode, and remembers her as a 'weird bald chick'; however, when Rachel meets her she is horrified to see that her hair has actually grown back and she is actually a very attractive woman. Since Rachel still has feelings for Ross, she, in a successful attempt to sabotage his relationship with Bonnie, convinces her to shave her hair off again in 'The One at the Beach' (airdate May 15, 1997; Season 3, No. 25). She makes a brief appearance at the beginning of 'The One with the Jellyfish', when Ross decides to dump her and get back together with Rachel. He implies that he made a dreadful mess of breaking up with her, both upsetting and enraging her in the process.",
        "_isMain":false,
        "_season":3
    },
    {
        "_id":17,
        "_picture":"Emily",
        "_name":"Emily Waltham",
        "_actor":"Helen Baxendale",
        "_bio":"The English niece of Rachel's boss Mr. Waltham, who arrives for a two-week visit to New York in 'The One with Joey's Dirty Day'. She has a whirlwind romance with Ross and they decide to get married. Her friendly relationship with Rachel soon changes during the wedding. The friends fly to London for their wedding in 'The One with Ross's Wedding' (airdate May 7, 1998; Season 4, No. 23 & 24), and Ross accidentally says Rachel's name at the altar, humiliating Emily in front of her friends and family. She aims to reconcile with him at the airport in 'The One After Ross Says Rachel' (airdate September 24, 1998; Season 5, No. 1) but sees Rachel with him about to go on their honeymoon and storms out again. Ross tries to convince her to move to New York.[e 88] She agrees but makes him promise to get rid of everything Rachel has ever come into physical contact with, in the friends' apartments, which would be virtually impossible, and she demands that he never see Rachel again. When she learns that he's having dinner with the old gang—including Rachel—she tells him she cannot trust him and she decides to end the marriage. She makes a final voice cameo in 'The One with the Ride Along', when she leaves a message on Ross's answering machine the night before her new wedding, telling him she is having second thoughts about it and is worried that they made a mistake splitting up. Rachel accidentally deletes the message, but tells Ross about it and convinces him not to respond to it. Emily's surname is that of the city where both creators of the show attended college.",
        "_isMain":false,
        "_season":4
    }
]
